#### PlanCircuit Members

---

|  |
| --- |
| PlanCircuit Class   Methods   Properties   See Also |

The  PlanCircuit  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPointInside | Returns a point inside the circuit. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Area | The enclosed area of the circuit. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsRoomLocated | Reports whether there is a room located in this circuit. |
| Public property | SideNum | The number of sides in the circuit. |

# See Also

PlanCircuit Class

Autodesk.Revit.DB Namespace